zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K322_SAI.h
#define SAI_RCR5_FBT_MASK                        (0x1F00U)
#define SAI_RCR5_FBT_SHIFT                       (8U)
#define SAI_RCR5_FBT_WIDTH                       (5U)
#define SAI_RCR5_FBT(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR5_FBT_SHIFT)) & SAI_RCR5_FBT_MASK)

#define SAI_RCR5_W0W_MASK                        (0x1F0000U)
#define SAI_RCR5_W0W_SHIFT                       (16U)
#define SAI_RCR5_W0W_WIDTH                       (5U)
#define SAI_RCR5_W0W(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR5_W0W_SHIFT)) & SAI_RCR5_W0W_MASK)

#define SAI_RCR5_WNW_MASK                        (0x1F000000U)
#define SAI_RCR5_WNW_SHIFT                       (24U)
#define SAI_RCR5_WNW_WIDTH                       (5U)
#define SAI_RCR5_WNW(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR5_WNW_SHIFT)) & SAI_RCR5_WNW_MASK)
/*! @} */

/*! @name RDR - Receive Data */
/*! @{ */

#define SAI_RDR_RDR_MASK                         (0xFFFFFFFFU)
#define SAI_RDR_RDR_SHIFT                        (0U)
#define SAI_RDR_RDR_WIDTH                        (32U)
#define SAI_RDR_RDR(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RDR_RDR_SHIFT)) & SAI_RDR_RDR_MASK)
/*! @} */

/*! @name RFR - Receive FIFO */
/*! @{ */

#define SAI_RFR_RFP_MASK                         (0xFU)
#define SAI_RFR_RFP_SHIFT                        (0U)
#define SAI_RFR_RFP_WIDTH                        (4U)
#define SAI_RFR_RFP(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RFR_RFP_SHIFT)) & SAI_RFR_RFP_MASK)

#define SAI_RFR_RCP_MASK                         (0x8000U)
#define SAI_RFR_RCP_SHIFT                        (15U)
#define SAI_RFR_RCP_WIDTH                        (1U)
#define SAI_RFR_RCP(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RFR_RCP_SHIFT)) & SAI_RFR_RCP_MASK)

#define SAI_RFR_WFP_MASK                         (0xF0000U)
#define SAI_RFR_WFP_SHIFT                        (16U)
#define SAI_RFR_WFP_WIDTH                        (4U)
#define SAI_RFR_WFP(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RFR_WFP_SHIFT)) & SAI_RFR_WFP_MASK)
/*! @} */

/*! @name RMR - Receive Mask */
/*! @{ */

#define SAI_RMR_RWM_MASK                         (0xFFFFU)
#define SAI_RMR_RWM_SHIFT                        (0U)
#define SAI_RMR_RWM_WIDTH                        (16U)
#define SAI_RMR_RWM(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RMR_RWM_SHIFT)) & SAI_RMR_RWM_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group SAI_Register_Masks */

/*!
 * @}
 */ /* end of group SAI_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K322_SAI_H_) */
